app/controllers/books_controller.rb

  def create
    @book = Book.new(params[:book])
    respond_to do |format|
      if @book.save
---
INSERT INTO `books` (`created_at`, `name`, `title`, `updated_at`) VALUES ('2012-05-23 12:21:43', '', '', '2012-05-23 12:21:43')