app/controllers/posts_controller.rb

INSERT INTO `posts` (`content`, `created_at`, `name`, `title`, `updated_at`) VALUES ('test12', '2012-05-23 07:06:51', 'shrisowdhaman', 'sample', '2012-05-23 07:06:51')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 6 LIMIT 1
---
  def update
    @post = Post.find(params[:id])