app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `failed_login_count`, `last_login_at`, `last_login_ip`, `last_request_at`, `login`, `login_count`, `password_salt`, `persistence_token`, `updated_at`) VALUES ('2012-05-29 09:22:41', '25913f91795040438adaeaef34bce7459349bcfacc8fc161dae02e1678b2c7db79aaccb469e497d42dcdc6c545f64f4090ad2da240ffdb74802a38f5b0681ee5', '2012-05-29 09:22:41', '127.0.0.1', 'example@example.com', 0, NULL, NULL, '2012-05-29 09:22:41', 'Testy McUserton', 1, 'XfGveVSRPC3MYFdzapzr', '6ee0b9231d09a0de392fa53d50a993f6badfeea28347cadbeabe3610bd8420362197add5bbf15cdc80d56f26da4152472b56d7511e8479479ee8eba732cd0a00', '2012-05-29 09:22:41')
---
  def create
   @user = User.new(params[:user])
   if @user.save